# Используем официальный образ Node.js в качестве базового
FROM node:18-alpine

# Устанавливаем pnpm, если он не включен в образ
RUN npm install -g pnpm

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файл package.json и pnpm-lock.yaml для установки зависимостей
COPY package.json pnpm-lock.yaml ./

# Устанавливаем зависимости с помощью pnpm с принудительным обновлением lock-файла
RUN pnpm install --force

# Копируем все остальные файлы приложения в контейнер
COPY . .

# Указываем команду для запуска приложения
CMD ["pnpm", "run", "deploy"]

# Указываем порт, если приложение слушает конкретный порт
# EXPOSE 3000
